Repository: MagdKamaldev/rider_admin_panel
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Add Branch
ar: إضافة فرع

# emptyValidation
source: Field cannot be empty
ar: لا يمكن أن يكون الحقل فارغًا

source: Branch Name
ar: اسم الفرع

source: Branch Address
ar: عنوان الفرع

source: Select Branch Hub
ar: اختر مركز الفرع

source: Branch Hub
ar: مركز الفرع

source: Select Branch Franchise
ar: اختر امتياز الفرع

# selectBranchFranchiseValidation
source: Please select a branch franchise!
ar: الرجاء اختيار امتياز الفرع!

source: Branch Franchise
ar: امتياز الفرع

source: Latitude
ar: خط العرض

source: Longitude
ar: خط الطول

source: Move Camera
ar: تحريك الكاميرا

# columnName
source: Name
ar: الاسم

# columnAddress
source: Address
ar: العنوان

# columnHub
source: Hub
ar: المحور

# columnFranchise
source: Franchise
ar: الامتياز

# columnCreatedAt
source: Created At
ar: تاريخ الإنشاء

# columnUpdatedAt
source: Updated At
ar: تاريخ التحديث

# columnActions
source: Actions
ar: الإجراءات

source: Confirm Delete
ar: تأكيد الحذف

source: Yes
ar: نعم

source: No
ar: لا

source: No branches yet!
ar: لا توجد فروع بعد!

# pleaseEnterBranchName
source: Please enter the branch name
ar: الرجاء إدخال اسم الفرع

# pleaseEnterBranchAddress
source: Please enter the branch address
ar: الرجاء إدخال عنوان الفرع

# pleaseSelectBranchHub
source: Please select the branch hub
ar: الرجاء اختيار مركز الفرع

# pleaseSelectBranchFranchise
source: Please select a branch franchise
ar: الرجاء اختيار امتياز الفرع

source: Edit Branch
ar: تحرير الفرع

source: Update Franchise
ar: تحديث الامتياز

# pleaseEnterFranchiseName
source: Please enter the franchise name!
ar: يرجى إدخال اسم الامتياز!

source: Franchise Name
ar: اسم الامتياز

source: Name
ar: الاسم

source: Branches
ar: الفروع

source: Created At
ar: تاريخ الإنشاء

source: Updated At
ar: تاريخ التحديث

source: Actions
ar: الإجراءات

source: N/A
ar: غير متوفر

# confirmDeleteFranchise
source: Are you sure you want to delete this franchise?
ar: هل أنت متأكد أنك تريد حذف هذا الامتياز؟

source: Add Franchise
ar: اضافة امتياز

source: Dashboard
ar: اللوحة الرئيسية

source: Hubs
ar: المراكز

source: Managers
ar: المديرين

source: Franchises
ar: الامتيازات

source: Riders
ar: السائقين

source: Navigation
ar: التنقل

source: Logout
ar: تسجيل الخروج

source: Add Hub
ar: إضافة مركز

# pleaseEnterHubName
source: Please enter the Hub's name!
ar: يرجى إدخال اسم المركز!

source: Hub Name
ar: اسم المركز

source: Select Hub Manager
ar: اختر مدير المركز

# selectHubManagerValidation
source: Please select a Hub Manager!
ar: يرجى اختيار مدير المركز!

source: Hub Manager
ar: مدير المركز

# selectHubLocation
source: Please select the hub location
ar: يرجى اختيار موقع المركز

source: Edit Hub
ar: تحرير المركز

source: Manager
ar: المدير

source: No Data Found
ar: لم يتم العثور على بيانات

source: Manager Name
ar: اسم المدير

# hubDeleteConfirmation
source: Are you sure you want to delete this Hub?
ar: هل أنت متأكد أنك تريد حذف هذا المركز؟

source: No Hubs Yet!
ar: لا توجد مراكز بعد!

# appName
source: Tayaar App
ar: تطبيق الإدارة

source: Password
ar: كلمة المرور

source: Login
ar: تسجيل الدخول

source: Manager Password
ar: كلمة مرور المدير

# pleaseEnterManagerName
source: Please enter the manager's name!
ar: الرجاء إدخال اسم المدير!

# pleaseEnterManagerPassword
source: Please enter the manager's password!
ar: الرجاء إدخال كلمة مرور المدير!

source: Add Manager
ar: إضافة مدير

source: Edit Manager
ar: تحرير المدير

source: No Managers Yet!
ar: لا يوجد مديرون بعد!

source: Add Rider
ar: إضافة راكب

source: Rider Name
ar: اسم الراكب

source: Rider National ID
ar: رقم الهوية الوطنية للراكب

source: Rider Phone Number
ar: رقم هاتف الراكب

source: Rider Password
ar: كلمة مرور الراكب

# pleaseEnterRiderName
source: Please enter the Rider name!
ar: الرجاء إدخال اسم الراكب!

# pleaseEnterRiderNationalId
source: Please enter the Rider National ID!
ar: الرجاء إدخال رقم الهوية الوطنية للراكب!

# pleaseEnterRiderPhoneNumber
source: Please enter the Rider Phone Number!
ar: الرجاء إدخال رقم هاتف الراكب!

# pleaseEnterRiderPassword
source: Please enter the Rider Password!
ar: الرجاء إدخال كلمة مرور الراكب!

source: Select Hub
ar: اختر المركز

# pleaseSelectHub
source: Please select a hub
ar: الرجاء اختيار مركز

source: Change Rider Hub
ar: تغيير مركز السائق

source: Select Rider Hub
ar: اختر مركز السائق

# selectRiderHubValidation
source: Please select a Rider hub!
ar: الرجاء اختيار مركز السائق!

source: Rider Hub
ar: مركز السائق

# changeRiderHubButton
source: Change Rider Hub
ar: تغيير مركز السائق

source: Change Shift Times
ar: تغيير أوقات الورديات

source: Select Start Time
ar: اختر وقت البدء

source: Start Time
ar: وقت البدء

source: Shift Duration:
ar: مدة الوردية:

source: Hours
ar: ساعات

source: Minutes
ar: دقائق

source: End Time
ar: وقت الانتهاء

source: Confirm
ar: تأكيد

# invalidTimeInput
source: Please enter valid hours and minutes.
ar: يرجى إدخال ساعات ودقائق صحيحة.

# selectStartTimeError
source: Please select a start time.
ar: يرجى اختيار وقت البدء.

source: Delete Rider
ar: حذف السائق

source: Edit Rider
ar: تعديل السائق

source: Change Hub
ar: تغيير المركز

# deleteRiderConfirmation
source: Are you sure you want to delete this Rider?
ar: هل أنت متأكد أنك تريد حذف هذا السائق؟

source: No Riders Yet!
ar: لا يوجد سائقون بعد!

source: User ID:
ar: معرف المستخدم:

source: National ID:
ar: الرقم القومي:

source: Phone:
ar: الهاتف:

source: Queue No:
ar: رقم الانتظار:

source: Current Order ID:
ar: معرف الطلب الحالي:

source: Change Language
ar: تغيير اللغة

source: Select Language
ar: اختر اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Settings
ar: الإعدادات

source: Time Margin
ar: الوقت المحدد

# valideMunites
source: Please enter valid minutes
ar: الرجاء إدخال دقائق صالحة

source: Roles and Permissions
ar: الأدوار والأذونات

source: Add Role
ar: إضافة دور
